
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hito1991/aws-ecs-terraform/actions/runs/7277285505)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.ecs_task_assume: Reading...
data.aws_iam_policy_document.ecs_assume: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-054815ee42e698c78]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0b757b327cfadf5bc]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-02373311b2da3577e]
aws_security_group.alb: Refreshing state... [id=sg-02df84af4230ab692]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:846128074014:targetgroup/go-simple-server-target-group/ec92018886c7dd47]
aws_security_group.ecs: Refreshing state... [id=sg-04141638f33bbb89a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09b6624041ec92195]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0c809db5600d00892]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0312259101dd7ed7a]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0618c79d2329f7595]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0369ec0e37dc36ad9]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-04b70642bce536260]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0322d3fc7701247b9]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01eb1db15aa20540b]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08523ac720dda1864]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3377403824]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0312259101dd7ed7a1080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ad6fcdea1e056c91]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-09e3dc784389d9586]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-09e8979b16fa91f08]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d8732445b2c7e42b]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03bff2c6743ffb031]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08256c2b81bd646e1]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:846128074014:loadbalancer/app/go-simple-server-alb/1d6a8fef77710419]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0ecfb5f7cfdfa1bde]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0956d55a039c2db70]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09b6624041ec921951080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0c809db5600d008921080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:846128074014:listener/app/go-simple-server-alb/1d6a8fef77710419/902f52493aff1692]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:846128074014:listener-rule/app/go-simple-server-alb/1d6a8fef77710419/902f52493aff1692/6170cc4a70690a54]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/go-simple-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "go-simple-server"
      + tags_all = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:846128074014:targetgroup/go-simple-server-target-group/ec92018886c7dd47"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-04141638f33bbb89a",
            ]
          + subnets          = [
              + "subnet-0369ec0e37dc36ad9",
              + "subnet-04b70642bce536260",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-simple-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "go-simple-server"
                        }
                    }
                  + name             = "go-simple-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "go-simple-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-simple-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_ecs_cluster.ecs_cluster: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_role.ecs_task: Creating...
aws_iam_role.ecs: Creating...
aws_iam_role.ecs_task: Creation complete after 0s [id=go-simple-server-ecs-task]
aws_iam_role.ecs: Creation complete after 0s [id=go-simple-server-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 1s [id=go-simple-server-ecs-20231220151404523200000001]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/go-simple-server]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 0s [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:846128074014:cluster/go-simple-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:846128074014:service/go-simple-server/go-simple-server]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":11,"Program":"tfcmt","SHA1":"eef87565cf76d5831e3316195f78a859642b9888","Vars":{},"WorkflowName":"Terraform"} -->